app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("name", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Gabriel"], ["email", "Brandao@orange.com"], ["phone", "73212341234"], ["created_at", "2016-03-01 20:31:00.157496"], ["updated_at", "2016-03-01 20:31:00.157496"]]
---
  def create
    @address = Address.new(address_params)

    respond_to do |format|
      if @address.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_address
      @address = Address.find(params[:id])