app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE (description LIKE '%asdfasdf%')  ORDER BY Title
---
  def index
    @games = Game.all

INSERT INTO "games" ("title", "platform", "picture", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

UPDATE "games" SET "title" = ?, "picture" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["title", "Super Smash Bros. Melee"], ["picture", "https://upload.wikimedia.org/wikipedia/en/7/75/Super_Smash_Bros_Melee_box_art.png"], ["updated_at", "2016-04-18 04:07:27.951691"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @game.update(game_params)